<!--
  Copyright 2016 Soren Stoutner <soren@stoutner.com>.

  Translation 2016 Aaron Gerlach <aaron@gerlach.com>.  Copyright assigned to Soren Stoutner <soren@stoutner.com>.

  Diese Datei ist Teil von Privacy Browser <https://www.stoutner.com/privacy-browser>.

  Privacy Browser ist eine kostenlose Software: Sie können sie
  unter den Bedingungen der GNU General Public License weiterverteilen
  mit Berufung auf die veröffentlichte Fassung der Free Software
  Foundation, entweder Version 3 der Lizenz oder (nach Ihrer
  Möglichkeit) jede neuere Version.

  Privacy Browser wird in der Hoffnung vertrieben nützlich zu sein,
  jedoch OHNE JEGLICHE GARANTIE; auch ohne die implizierte
  Garantie auf MARKTGÄNGLICHKEIT oder BEREITSCHAFT FÜR
  BESTIMMTE ANWENDUNGEN. Nutzen Sie die GNU General Public
  License für mehr Details.

  Sie sollten eine Kopie der GNU General Public License zusammen mit
  Privacy Browser erhalten haben. Wenn nicht, besuchen Sie
  <http://www.gnu.org/licenses/>. -->

<html>
<head>
    <style>
        h3 {
        color: 0D4781;
        }
    </style>
</head>

<body>
<h3>Echte Privatsph&auml;re</h3>

<p>Privacy Browser wurde entwickelt um Ihnen w&auml;hrend des Surfens die maximal m&ouml;gliche Kontrolle &uuml;ber Ihre Privatsph&auml;re zu gew&auml;hren.
    Wenn Sie sich mit einer Website verbinden werden bestimmte Informationen, die zum Verarbeiten der Verbindung n&ouml;tig sind, an den Server gesandt.
    Der Server erh&auml;lt beispielsweise Ihre IP-Adresse und eine Port-Nummer, welche er ben&ouml;tigt, damit er wei&szlig;, wohin er antworten soll.
    Diese Informationen werden h&auml;ufig gespeichert, damit der Webseitenbetreiber Statistiken generieren kann dar&uuml;ber, wie oft eine Website geladen wird
    und wie viele verschiedene IP-Adressen sie besucht haben.</p>

<p>Dar&uuml;ber hinaus wollen die meisten Webseitenbetreiber Ihr Surfverhalten im ganzen Internet und nicht nur auf einem einzigen Server nachverfolgen. Sie nutzen dabei verschiedene technische M&ouml;glichkeiten.
    Einige davon nutzen das Anfragen oder Platzieren von bestimmten Informationen auf Ihrem Ger&auml;t, die das Nachverfolgen erm&ouml;glichen.  Nahezu alle Browser nehmen freiwillig an dieser Verfolgung Teil,
    ohne den Nutzer dar&uuml;ber zu informieren. Privacy Browser ist dazu entwickelt, dass der Benutzer so viel Information und Kontrolle &uuml;ber diese Verfolgungstechniken wie m&ouml;glich erh&auml;lt.</p>


<h3>Android's WebView Einschr&auml;nkungen</h3>

<p>Privacy Browser benutzt Androids integrierte WebView um Webseiten zu rendern. Es gibt einige Einschr&auml;nkungen bei den M&ouml;glichkeiten, die WebView zur Kontrolle der Privatsph&auml;re bietet. Zum Beispiel
    ist es nicht m&ouml;glich, nur bestimmte Javascript-Kommandos ohne die anderen gleichzeitig zu (de-)aktivieren. Sobald Privacy Browser zu einem alle in WebView m&ouml;glichen Privatsph&auml;rekontrollen beinhaltenden, umfassenden Browser herangewachsen ist,
    ist es eine &Uuml;berlegung wert, eine eigene, &uuml;berarbeitete WebView oder eine andere Rendering Engine zu nutzen.</p>
</body>
</html>