<!--
  Copyright 2016-2017 Soren Stoutner <soren@stoutner.com>.

  Translation 2017 Jose A. León Becerra.  Copyright assigned to Soren Stoutner <soren@stoutner.com>.

  Este archivo es parte de Navegador Privado (Privacy Browser) <https://www.stoutner.com/privacy-browser>.

  Navegador Privado (Privacy Browser) es software libre: puedes redistribuirlo y/o modificarlo
  bajo los términos de la Licencia Pública General GNU, como se ha publicado por
  la Fundación del Software Libre, tanto la versión 3 de la Licencia, o
  (a su opción) cualquier versión posterior.

  Navegador Privado (Privacy Browser) es distribuído con la esperanza de que será útil,
  pero SIN NINGUNA GARANTÍA; ni siquiera la garantía implícita de
  MERCANTILIDAD o APTITUD PARA UN PROPÓSITO PARTICULAR.  Vea la
  Licencia Pública General para más detalles.

  Usted debería haber recibido una copia de la Licencia Pública General GNU
  junto con Navegador Privado (Privacy Browser).  Si no es así, vea <http://www.gnu.org/licenses/>. -->

<html>
    <head>
        <!-- We have to make an image into its own block to center it. -->
        <style>
            h3 {
                color: 0D4781;
            }

            img.center {
                display: block;
                margin-left: auto;
                margin-right: auto;
            }
        </style>
    </head>

    <body>
        <h3>Javascript es poderoso</h3>

        <p>En los principios de internet las p&aacute;ginas web eran est&aacute;ticas, s&oacute;lo conten&iacute;an textos e im&aacute;genes que eran mostradas en la pantalla y no pod&iacute;an cambiarse o interactuar con el usuario.
            Por supuesto, s&oacute;lo lo muy interesante podr&iacute;a ocurrir con un contenido est&aacute;tico. Se desarrollaron diferentes tecnolog&iacute;as para facilitar p&aacute;ginas web din&aacute;micas. Javascript
            es una de estas tecnolog&iacute;as.</p>

        <p>Javascript es un lenguaje de programaci&oacute;n. Muchos servidores web alojan programas escritos en Javascript, que son enviados a los dispositivos como parte de la p&aacute;gina
            web.  El dispositivo ejecuta este Javascript en su procesador local y sigue los comandos del programa, el cual puede animar imágenes en dicho sitio web, abrir un men&uacute; emergente, y
            hacer muchas otras cosas &uacute;tiles.</p>


        <h3>Javascript es peligroso</h3>
        <p>Por supuesto, el concepto de ejecutar programas arbitrarios de un sitio web es potencialmente peligroso. Es por ello que hay limitaciones en Javascript para evitar que haga cosas
            como instalar virus. Sin embargo, resulta que estas limitaciones son demasiado amplias. Abajo tenemos una captura de pantalla de la web <a href="http://webkay.robinlinus.com">webkay</a>, que es una web
            que muestra el tipo de informaci&oacute;n que Javascript puede producir sobre un dispositivo. <a href="http://www.browserleaks.com/">Browser Leaks</a> es otro buen recurso.</p>

        <p><img class="center" src="../en/images/webkay.png" height="640" width="360"></p>

        <p>Con fines de privacidad, lo ideal ser&iacute;a navegar por internet con Javascript deshabilitado. Sin embargo, hay algunas p&aacute;ginas web que requieren leg&iacute;timamente de Javascript para lograr sus
            prop&oacute;sitos, y otras que no funcionan correctamente sin Javascript aunque pudieran programarse para hacerlo as&iacute;. Navegador Privado aborda esto haciendo sencillo el poder activar
            (on) y desactivar (off) Javascript. Tocando el escudo de privacidad alternará entre azul <img src="../en/images/privacy_browser.png" height="16" width="16"> o amarillo <img src="../en/images/warning.png" height="16" width="16">
            (los cuales indican que Javascript est&aacute; deshabilitado) y rojo <img src="../en/images/javascript_enabled.png" height="16" width="16"> (Javascript habilitado).
            Revisar la diferente información que webkay puede recoger con Javascript habilitado y deshabilitado es informativo.</p>

        <p>Navegar por internet con Javascript deshabilitado, y s&oacute;lo habilitarlo cuando sea necesario, hace mucho en proteger la privacidad del usuario. Adem&aacute;s, Javascript se usa para cargar muchos de
            los molestos anuncios y dem&aacute;s basura que viene con las m&aacute;s modernas p&aacute;ginas web. Al deshabilitarlo, las p&aacute;ginas web cargar&aacute;n m&aacute;s r&aacute;pido, consumir&aacute;n menos tr&aacute;fico de red,
            y contendr&aacute;n menos molestos anuncios, en lugar de aquellos que hacen cosas como cubrir el texto de toda la p&aacute;gina web.</p>
    </body>
</html>