<!--
  Copyright 2017 Soren Stoutner <soren@stoutner.com>.

  Translation 2017 Jose A. León Becerra <emails@joseleon.me>.  Copyright assigned to Soren Stoutner <soren@stoutner.com>.

  Este archivo es parte de Navegador Privado (Privacy Browser) <https://www.stoutner.com/privacy-browser>.

  Navegador Privado (Privacy Browser) es software libre: puedes redistribuirlo y/o modificarlo
  bajo los términos de la Licencia Pública General GNU, como se ha publicado por
  la Fundación del Software Libre, tanto la versión 3 de la Licencia, o
  (a su opción) cualquier versión posterior.

  Navegador Privado (Privacy Browser) es distribuído con la esperanza de que será útil,
  pero SIN NINGUNA GARANTÍA; ni siquiera la garantía implícita de
  MERCANTILIDAD o APTITUD PARA UN PROPÓSITO PARTICULAR.  Vea la
  Licencia Pública General para más detalles.

  Usted debería haber recibido una copia de la Licencia Pública General GNU
  junto con Navegador Privado (Privacy Browser).  Si no es así, vea <http://www.gnu.org/licenses/>. -->

<html>
    <head>
        <style>
            h3 {
                color: 0D4781;
            }

            img.center {
                display: block;
                margin-left: auto;
                margin-right: auto;
            }
        </style>
    </head>

    <body>
        <h3>Tor y sus l&iacute;mites</h3>

        <p>Existen dos categor&iacute;as generales de malos actores que quieren infringir la privacidad de la web: gobiernos maliciosos con acceso a ISPs (Proveedores de Servicios de Internet) y grandes corporaciones que ofrecen redes sociales y de publicidad.
            TOR (El Enrutador de Cebolla) es &uacute;til en proteger la privacidad de gobiernos maliciosos (que esp&iacute;an el tr&aacute;fico en tr&aacute;nsito) pero no de grandes corporaciones (que incrustan c&oacute;digo malicioso en los servidores web).</p>


        <h3>Gobiernos maliciosos</h3>

        <p>Los gobiernos maliciosos a menudo espían a sus ciudadanos para castigar la disidencia o la actividad de derechos humanos.
            Normalmente suelen operar los ISPs locales o los fuerzan a revelar informaci&oacute;n mostrando cada direcci&oacute;n IP que visita cada usuario.
            Tor est&aacute; dise&ntilde;ado para vencer esta infracci&oacute;n de privacidad encriptando el tr&aacute;fico del dispositivo de un usuario,
            enrut&aacute;ndolo a trav&eacute;s de tres servidores separados en internet antes de enviarlo al destino final.
            Esto significa que ning&uacute;n ISP local, servidor o p&aacute;gina web pueden, a la vez, conocer la direcci&oacute;n IP del dispositivo del usuario y la direcci&oacute;n IP del servidor web final.
            Los gobiernos maliciosos y los ISPs que ellos controlan no pueden decir a qu&eacute; servidores web est&aacute; accediendo un determinado usuario, aunque pueden decir que ese usuario est&aacute; usando Tor.
            En algunas partes del mundo, usar Tor podr&iacute;a interpretarse como una prueba de conducta ilegal (“si no tuvieras nada que esconder no estar&iacute;as encriptando tu tr&aacute;fico”)
            y los usuarios podr&iacute;an ser castigados porque los gobiernos asumen que est&aacute;n haciendo algo prohibido. Por tanto, Tor puede ser &uacute;til, pero no es la panacea.</p>


        <h3>Grandes corporaciones</h3>

        <p>Cuando un usuario se conecta a un servidor web, &eacute;ste puede ver la direcci&oacute;n IP del usuario.
            Aunque esto no es una ciencia perfecta, las direcciones IP se pueden convertir a direcciones f&iacute;sicas con <a href="https://www.whatismyip.com/">bastante precisi&oacute;n</a>.
            Los peque&ntilde;os servidores web normalmente se basan en las direcciones IP para identificar la ubicaci&oacute;n de los usuarios que visitan su web. Tor es una buena soluci&oacute;n para ocultar la ubicaci&oacute;n del usuario de estos servidores.
            Pero las m&aacute;s grandes corporaciones que poseen medios sociales y redes de publicidad usan un perfil completo de informaci&oacute;n diseñado para rastrear a los usuarios a trav&eacute;s de los dispositivos y direcciones IP.
            Estos perfiles emplean una variedad de t&eacute;cnicas para identificar a los usuarios, incluyendo Javascript, cookies, IDs de seguimiento, y <a href="https://panopticlick.eff.org/">huellas del navegador</a>.
            Debido a que la gran mayoría de p&aacute;ginas web en internet, o cargan un anuncio de una de las principales redes, o integran iconos de medios sociales con su Javascript asociado,
            estas corporaciones han creado perfiles para casi todos los usuarios en l&iacute;nea y pueden rastrear su actividad en internet a trav&eacute;s de sitios que no est&aacute;n relacionados.</p>

        <p>Ellos rastrean cada sitio web visitado, todo lo que se compra, cada tarjeta de cr&eacute;dito que es usada para realizar una compra, cada direcci&oacute;n a la que se env&iacute;an los art&iacute;culos,
            y los metadatos GPS de cada im&aacute;gen que se sube a internet.
            Construyen un perfil de la edad del usuario, g&eacute;nero, estado civil, direcci&oacute;n, afiliaciones pol&iacute;ticas, afiliaciones religiosas, circunstancias familiares, n&uacute;mero de mascotas, y cualquier otra cosa que caiga en sus manos.
            Incluso compran bases de datos de transacciones con tarjeta de cr&eacute;dito en tiendas locales, para así poder rastrear de los usuarios en sus perfiles los patrones de compra que hacen cuando no est&aacute;n conectados.
            Debido a que ya tienen informaci&oacute;n de direcci&oacute;n mucho m&aacute;s precisa sobre un usuario que lo que pueda revelar una direcci&oacute;n IP,
            Tor no ofrece una verdadera protecci&oacute;n de la privacidad contra las grandes corporaciones.</p>

        <p>La &uacute;nica mejor protecci&oacute;n de la privacidad contra las grandes corporaciones es navegar por la web con Javascript deshabilitado, seguido de bloquear redes publicitarias, inhabilitar cookies y almacenamiento DOM,
            y usar un navegador del que sea dif&iacute;cil recoger huellas.</p>


        <h3>Usando Tor</h3>

        <p>A pesar de sus limitaciones, Tor puede ser &uacute;til en algunas circunstancias. El proyecto Tor tiene una app para Android llamada Orbot, que est&aacute; disponible en F-Droid y en todos los sitios donde se distribuye Navegador Privado.
            Navegador Privado tiene un ajuste para usar Orbot como un proxy. Cuando se enciende, la barra de aplicaciones de Navegador Privado tendr&aacute; un fondo azul claro en lugar del gris claro por defecto.
            Cuando el ajuste proxy Orbot de Navegador Privado est&aacute; habilitado, el acceso a internet no funcionar&aacute; a menos que se est&eacute; ejecutando Orbot y est&eacute; conectado a Tor.
            Ya que el tr&aacute;fico se est&aacute; enrutando a trav&eacute;s de varios nodos Tor, usar Tor es a menudo mucho m&aacute;s lento que conectar directamente a internet.</p>

        <img class="center" src="images/tor.png" height="640" width="360">
    </body>
</html>