<!--
  Copyright 2016-2017 Soren Stoutner <soren@stoutner.com>.

  Translation 2017 Jose A. León Becerra.  Copyright assigned to Soren Stoutner <soren@stoutner.com>.

  Este archivo es parte de Navegador Privado (Privacy Browser) <https://www.stoutner.com/privacy-browser>.

  Navegador Privado (Privacy Browser) es software libre: puedes redistribuirlo y/o modificarlo
  bajo los términos de la Licencia Pública General GNU, como se ha publicado por
  la Fundación del Software Libre, tanto la versión 3 de la Licencia, o
  (a su opción) cualquier versión posterior.

  Navegador Privado (Privacy Browser) es distribuído con la esperanza de que será útil,
  pero SIN NINGUNA GARANTÍA; ni siquiera la garantía implícita de
  MERCANTILIDAD o APTITUD PARA UN PROPÓSITO PARTICULAR.  Vea la
  Licencia Pública General para más detalles.

  Usted debería haber recibido una copia de la Licencia Pública General GNU
  junto con Navegador Privado (Privacy Browser).  Si no es así, vea <http://www.gnu.org/licenses/>. -->

<html>
    <head>
        <style>
            h3 {
                color: 0D4781;
            }
        </style>
    </head>

    <body>
    <h3>Verdadera privacidad</h3>

    <p>Navegador Privado est&aacute; dise&ntilde;ado para ofrecerte todo el control posible de tu privacidad mientras navegas por internet.
        Cuando conectas a un sitio web, parte de la informaci&oacute;n que es necesaria para facilitar la conexi&oacute;n son transferidas al servidor.
        Por ejemplo, el servidor recibir&aacute; tu direcci&oacute;n IP y un n&uacute;mero de puerto, los cuales son necesarios, as&iacute; sabe d&oacute;nde enviar la respuesta.
        Esta informaci&oacute;n es a menudo registrada por el servidor, permitiendo al desarrollador del sitio web realizar informes mostrando las veces
        que ha sido cargada una web y cu&aacute;ntas diferentes direcciones IP accedieron a ella.</p>

    <p>Sin embargo, la mayor&iacute;a de operadores de un sitio web quieren rastrear tu navegaci&oacute;n web a trav&eacute;s de muchas webs, no s&oacute;lo en un servidor.
        Existen muchas t&eacute;cnicas que usan para conseguirlo. Algunas de ellas solicitan o colocan informaci&oacute;n extra en tu dispositivo que facilita este rastreo.
        Casi todos los navegadores participar&aacute;n voluntariamente en este rastreo sin informar al usuario de lo que est&aacute;n haciendo.
        Navegador Privado est&aacute; dise&ntilde;ado para ofrecer al usuario toda la información y control sobre estas t&eacute;cnicas de rastreo como sea posible.</p>


    <h3>Limitaciones del WebView de Android</h3>

    <p>Navegador Privado usa el WebView que incorpora Android para interpretar los sitios web.
        Existen algunas limitaciones en los controles que WebView expone para administrar la configuraci&oacute;n de privacidad.
        Por ejemplo, no es posible habilitar algunos comandos JavaScript mientras que se deshabilitan otros.
        Cuando Navegador Privado haya madurado lo suficiente como para aprovechar al m&aacute;ximo todas las opciones de privacidad que ofrece WebView,
        se considerar&aacute; realizar un WebView personalizado o usar un motor de interpretaci&oacute;n diferente.</p>
    </body>
</html>