<!--
  Copyright 2016-2017 Soren Stoutner <soren@stoutner.com>.

  Translation 2017 Jose A. León Becerra <emails@joseleon.me>.  Copyright assigned to Soren Stoutner <soren@stoutner.com>.

  Este archivo es parte de Navegador Privado (Privacy Browser) <https://www.stoutner.com/privacy-browser>.

  Navegador Privado (Privacy Browser) es software libre: puedes redistribuirlo y/o modificarlo
  bajo los términos de la Licencia Pública General GNU, como se ha publicado por
  la Fundación del Software Libre, tanto la versión 3 de la Licencia, o
  (a su opción) cualquier versión posterior.

  Navegador Privado (Privacy Browser) es distribuído con la esperanza de que será útil,
  pero SIN NINGUNA GARANTÍA; ni siquiera la garantía implícita de
  MERCANTILIDAD o APTITUD PARA UN PROPÓSITO PARTICULAR.  Vea la
  Licencia Pública General para más detalles.

  Usted debería haber recibido una copia de la Licencia Pública General GNU
  junto con Navegador Privado (Privacy Browser).  Si no es así, vea <http://www.gnu.org/licenses/>. -->

<html>
    <head>
        <style>
            h3 {
                color: 0D4781;
            }

            img.title {
                vertical-align: bottom;
                height: 32;
                width: 32;
            }
        </style>
    </head>

    <body>
        <h3><img class="title" src="../en/images/cookie_dark_blue.png"> Cookies de primera parte</h3>

        <p>Las cookies de primera parte son cookies establecidas por la p&aacute;gina web en la barra URL de la parte superior de la p&aacute;gina.</p>

        <p>Desde los primeros d&iacute;as de internet se hizo obvio que ser&iacute;a algo ventajoso para las p&aacute;ginas web el poder guardar informaci&oacute;n en un ordenador para un acceso futuro. Por ejemplo,
            una p&aacute;gina web que muestra informaci&oacute;n del tiempo podr&iacute;a preguntar al usuario por un c&oacute;digo postal, y luego guardarlo en una cookie. La pr&oacute;xima vez que el usuario visitara la
            p&aacute;gina web, la informaci&oacute;n del tiempo ser&iacute;a autom&aacute;ticamente cargada para ese c&oacute;digo postal, sin que el usuario tenga que poner su c&oacute;digo postal, y sin la necesidad por parte del usuario
            de crear una cuenta en la p&aacute;gina web (que ser&iacute;a excesivo para una tarea tan simple).</p>

        <p>Como todo lo dem&aacute;s en la web, gente inteligente averigu&oacute; todas las formas de abusar de las cookies para hacer cosas que los usuarios no aprobar&iacute;an si supieran que est&aacute;n ocurriendo. Por
            ejemplo, una p&aacute;gina web puede establecer una cookie con un n&uacute;mero de serie &uacute;nico en un dispositivo. Luego, cada vez que el usuario visite la p&aacute;gina web con ese dispositivo, puede ser
            vinculado a un perfil &uacute;nico, incluso si el dispositivo se conecta desde direcciones IP diferentes, como a menudo hacen los tel&eacute;fonos celulares.</p>

        <p>Muchas p&aacute;ginas web con inicios de sesi&oacute;n requieren que sean habilitadas las cookies de primera parte para que un determinado usuario siga conectado en dicha sesi&oacute;n. Las cookies no
            son la &uacute;nica forma en que una p&aacute;gina web puede mantener conectado en una sesi&oacute;n a un usuario mientras se mueve de una p&aacute;gina a otra en ese sitio web, pero si una p&aacute;gina web en particular
            ha elegido implementar inicios de sesi&oacute;n de esa manera, la &uacute;nica forma de poder usar la funcionalidad de ese sitio web ser&aacute; habilitando cookies de primera parte.</p>

        <p>Si las cookies de primera parte est&aacute;n habilitadas pero Javascript est&aacute; deshabilitado, el icono de privacidad ser&aacute; amarillo <img src="../en/images/warning.png" height="16" width="16"> como advertencia.</p>


        <h3><img class="title" src="../en/images/cookie_dark_blue.png"> Cookies de terceras partes</h3>

        <p>Las cookies de terceras partes son establecidas por ciertas partes de una p&aacute;gina web que son cargadas desde servidores diferentes a la URL de la parte superior de la p&aacute;gina. Por ejemplo,
            la mayor&iacute;a de p&aacute;ginas web que tienen anuncios los cargan desde una compa&ntilde;&iacute;a de publicidad de terceros, como <a href="https://www.google.com/adsense/start/#?modal_active=none">Ad Sense</a>
            de Google. Cada vez que se carga la p&aacute;gina web, solicita a la compa&ntilde;&iacute;a de publicidad que muestre un anuncio. La compa&ntilde;&iacute;a de publicidad analiza cualquier informaci&oacute;n que pueda tener sobre el usuario,
            analiza la tasa actual que los anunciantes est&aacute;n dispuestos a pagar por sus anuncios, y selecciona uno  para mostrar. La secci&oacute;n de la p&aacute;gina web que muestra los anuncios es cargada desde el servidor
            de la compa&ntilde;&iacute;a de terceros en vez de hacerlo desde el servidor principal.</p>

        <p>Ya que la mayoría de los anuncios en internet se muestran desde solo unas peque&ntilde;as compa&ntilde;&iacute;as, no les llev&oacute; a &eacute;stas mucho tiempo en darse cuenta que podr&iacute;an establecer una cookie de seguimiento
            en el dispositivo del usuario y as&iacute; conocer cualquier lugar al que el usuario va. Cada vez que un anuncio se carga desde una compa&ntilde;&iacute;a, lo primero que hace es comprobar si el dispositivo ya tiene un
            &uacute;nico n&uacute;mero de serie en una cookie de seguimiento. Si es as&iacute;, busca el perfil para ese n&uacute;mero de serie y toma nota del nuevo sitio web. Es por esto que un usuario puede hacer una b&uacute;squeda en
            una p&aacute;gina web por un producto que normalmente no busca, como nueces, y luego de pronto empieza a ver anuncios de nueces en cada p&aacute;gina web que visita.</p>

        <p>Adem&aacute;s de compa&ntilde;&iacute;as de publicidad, las p&aacute;ginas de redes sociales descubrieron que tambi&eacute;n pod&iacute;an entrar en acci&oacute;n. Hace unos pocos a&ntilde;os, las principales p&aacute;ginas de redes sociales
            como Facebook y Twitter convencieron a un gran n&uacute;mero de p&aacute;ginas web que ser&iacute;a por su mejor inter&eacute;s colocar peque&ntilde;os iconos de redes sociales en sus p&aacute;ginas. &Eacute;stos no son s&oacute;lo im&aacute;genes.
            Contienen <a href="https://developers.facebook.com/docs/plugins/like-button/">c&oacute;digo incrustado</a> que enlazan de nuevo a la web de la red social, y entre otras cosas cargan una cookie de terceras partes en el dispositivo.
            Estas cookies se colocan aunque el usuario no tenga una cuenta con la plataforma de la red social. A trav&eacute;s del tiempo, compa&ntilde;&iacute;as como Facebook (la cual tambi&eacute;n corre una red de anuncios) han constru&iacute;do un gran
            n&uacute;mero de perfiles detallados sobre personas que <a href="http://www.theverge.com/2016/5/27/11795248/facebook-ad-network-non-users-cookies-plug-ins">ni siquiera han creado una cuenta en su web</a>.

        <p>Pr&aacute;cticamente no existe una buena raz&oacute;n por la cual se deban habilitar las cookies de terceras partes. En dispositivos con Android KitKat o m&aacute;s antiguos (versi&oacute;n <= 4.4.4 o API <= 20). WebView no
            <a href="https://developer.android.com/reference/android/webkit/CookieManager.html#acceptThirdPartyCookies(android.webkit.WebView)">diferencia entre cookies de primera parte y de terceras partes</a>. Así que habilitando las cookies de
            primera parte se habilitar&aacute;n tambi&eacute;n las de terceras partes.</p>


        <h3><img class="title" src="../en/images/ic_web_dark_blue.png"> Almacenamiento DOM</h3>

        <p>El almacenamiento Modelo de Objeto de Documento (Document Object Model), tambi&eacute;n conocido como almacenamiento web, es como cookies pero m&aacute;s poderoso. Mientras el tama&ntilde;o de almacenamiento combinado m&aacute;ximo para todas las cookies
            de una &uacute;nica URL es de 4 kilobytes, el almacenamiento DOM puede tener <a href="https://en.wikipedia.org/wiki/Web_storage#Storage_size">megabytes por sitio web</a>. Debido a que el almacenamiento DOM usa Javascript para leer y escribir
            los datos, habilitarlo no har&aacute; nada a menos que Javascript sea habilitado tambi&eacute;n.</p>


        <h3><img class="title" src="../en/images/ic_subtitles_dark_blue.png"> Datos de formulario</h3>

        <p>Los datos de formulario contienen informaci&oacute;n escrita en formularios web, como nombres de usuario, direcciones, n&uacute;meros de tel&eacute;fono, etc&eacute;tera, y los enumera en un cuadro desplegable en futuras visitas.
            A diferencia de las otras formas de almacenamiento local, los datos de formulario no son enviados al servidor web sin una interacci&oacute;n espec&iacute;fica del usuario.</p>
    </body>
</html>